app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Test 1"], ["created_at", Wed, 17 Sep 2014 16:35:03 UTC +00:00], ["updated_at", Wed, 17 Sep 2014 16:35:03 UTC +00:00], ["user_id", 101]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save